# JustifyOffset Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
NumberSystem..::..JustifyOffset Property
NumberSystem Class See Also
---
The offset to the justification curve.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public double JustifyOffset { get; set; }
```

Visual Basic
---
```text
Public Property JustifyOffset As Double
	Get
	Set
```

Visual C++
---
```text
public:
property double JustifyOffset {
	double get ();
	void set (double value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | When setting this property: The given value for justifyOffset must be no more than 30000 feet in absolute value. |

# See Also
NumberSystem Class
Autodesk.Revit.DB Namespace